# 3. Села батарейка (легкая)
#
# Производители умных часов стараются заботиться
# о наилучшем пользовательском опыте. Чтобы часы
# выполняли свои функции, в них постоянно должны быть активны
# n
# n приложений. Один из важных показателей работы
# устройства — то, сколько часов оно сможет
# работать без подзарядки. Экспериментальным
# путём для каждого приложения было выяснено,
# сколько процентов батареи оно тратит в час.
# Помогите рассчитать, сколько полных часов будут
#
# Формат ввода
# В первой строке содержится целое число
# n
# n — количество стандартных приложений (1≤n≤10^5).
# В следующей строке содержится ровно n целых чисел ai,
# из которых 1≤ai≤100 обозначает, сколько процентов
# батареи приложение съедает в час.
#
# Формат вывода
# В единственной строке выведите одно целое число,
# обозначающее количество полных часов,
# которые выдержит батарея. Изначально
# батарея заряжена на все 100%.
#
# Ограничения
#
# Ограничение времени 1 с
# Ограничение памяти 256 МБ
#
# Пример 1
# Ввод
# 3
# 1 4 5
# Вывод
# 10