# 9. График работ (средняя)
#
# Пете на работе выдали n задач.
#
# Каждый день, начиная с первого, Петя может
# выполнить ровно одну задачу.
# Про каждую задачу известен последний день di, когда
# е можно выполнить, и величина стресса wi, который
# Петя испытает, если задача не будет выполнена
# в срок и надо будет просить помощи коллег.
#
# Помогите Пете решить, в каком порядке выполнять
# задачи, чтобы уменьшить его суммарный стресс.
#
# Формат ввода
# В первой строке дано единственное
# натуральное число n(1≤n≤200 000) — количество задач.
#
# Затем следует n строк, в каждой из которых
# содержится по два числа di и wi (1≤di≤200 000, 1≤wi≤200 000) — последний
# день, когда можно выполнить задачу, и стресс при пропуске дедлайна для i - йзадачи.
#
# Формат вывода
#
# Выведите единственное число, равное минимальному возможному суммарному стрессу.
#
# Ограничения
#
# Ограничение времени 1 с
# Ограничение памяти 256 МБ
#
# Пример 1
# Ввод
# 3
# 1 2
# 1 3
# 3 1
# Вывод
# 2


import sys


def main():
    """
    Пример ввода и вывода числа n, где -10^9 < n < 10^9:
    n = int(input())
    print(n)
    """
    pass


if __name__ == '__main__':
    main()